//  Напишите программу, которая принимает
// на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5

void CountDigits (int num){
    Console.WriteLine((num.ToString()).Length);
}

CountDigits (456);
CountDigits (78);
CountDigits (89126);





